tutorials/counterFlowFlame2D/Allrun
#!/bin/sh

blockMesh -region fluid

multiRegionFoam

touch result.foam
